# Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]

list = [1, 2, 3, 5, 1, 5, 3, 10, 3, 7, 1, 8]
list1 = []

for i in list:
    if i not in list1:
        list1.append(i)


print(list1)
